[
    {
        "page": 1,
        "content": "Program Name: TAFDC\nTransitional Aid to Families with Dependent Children\nAgency: Massachusetts Department of Transitional Assistance (DTA)\nDescription: Combined state and federally funded program which provides monthly cash\npayments to very low income and low asset-holding families.This is an economic assistance\n(cash benefit) program that helps pregnant individuals, families and caregivers explore\nopportunities, improve their finances, and reach their goals.\nWebsite: https://www.mass.gov/how-to/apply-for-tafdc\nhttps://dtaconnect.eohhs.mass.gov/\nEligibility:\nTo be eligible, an individual must:\n●\nHave children 18 or younger,\n●\nAre pregnant and are due in less than 4 months; if you are under age 20 you may be\neligible at any stage of pregnancy, and/or\n●\nAre a caregiver for a child you are related to but who is not your biological or adopted\nchild. As a caregiver, you can apply for TAFDC for yourself and the child(ren) or only the\nchild(ren) in your care. If you apply only for the child(ren) DTA will not look at your\nincome when you apply, even though the application is in your name. If the child in your\ncase has income, that may affect eligibility.\n●\nYou live in Massachusetts,\n●\nYou or someone in your family are a U.S. citizen or an eligible immigrant, and\n●\nYour income is below the TAFDC limits. Your family's gross income must be under the\nincome limit. (Gross income is the amount before things like taxes are taken out.)\n●\nThe income limit is based on your family size and the type of housing you live in.\n●\nThere are different rules if you are a teen parent under age 18 living with your\nparent(s).\nHow do I know if my family’s income is below the TAFDC limit?\n1.\nAdd up all income before taxes or other deductions. Do not count income of a foster\nchild or someone who gets SSI.\n2.\nIf you are working, subtract $200 from your monthly gross earnings. Then, if you got\nTAFDC in the last 4 months, subtract half of the rest of your gross earnings. These are\ndeductions.\n3.\nIf you pay for child care, tell DTA during your application interview. We may be able to\nsubtract more of your earnings.\nTAFDC Eligibility Chart\nFamily Size\nPublic or subsidized housing\nPrivate housing\n1\n$513\n$553\n"
    },
    {
        "page": 2,
        "content": "2\n$648\n$688\n3\n$783\n$823\n4\n$912\n$952\n5\n$1,045\n$1,085\n6\n$1,183\n$1,223\n7\n$1,316\n$1,356\n8\n$1,448\n$1,488\nEach additional household\nmember\n+$139\n+139\nWhat are the rules if I am a teen parent under age 18 and I live with my parent(s)?\nIf you are a teen parent and you live with your parent(s), monthly gross income must be\nless than the amounts below.\nTAFDC Eligibility Chart for parents under age 18\nFamily size\nIncome\n1\n$2,510\n2\n$3,407\n3\n$4,303\n4\n$5,200\n5\n$6,097\n6\n$6,993\n7\n$7,890\n"
    },
    {
        "page": 3,
        "content": "8\n$8,787\nEach additional household member\n+$897\nChild Support rules for TAFDC: Every child who gets TAFDC must have a child support case\nunless they live with both parents. But, you may not have to apply for child support for a child if\nyou have experienced domestic violence or have safety concerns. Tell us if you are worried\nabout this.\nIf you do not already have a child support order, DTA will connect you to the Department of\nRevenue (DOR). DOR can help you establish paternity and get a child support order.\nThe state of Massachusetts must keep any child support paid for children who get TAFDC. If a\nchild’s parent (who does not live with the child) pays child support while you get TAFDC, you will\nget the first $50 each month. This is in addition to TAFDC.\nCan DTA help connect me to employment and training services?\nDTA will connect all applicants over 18 who can work to JobQuest - the online system\nconnecting people to the MassHire Career Center network. Some applicants must register as\npart of their TAFDC application.\nYou can register now for access to free tools and resources to support your career pathway.\nDTA can also help you register after you apply. Learn more and register here.\nDisability accommodation: If you have a disability or health problem that makes it hard for you\nto do something DTA asks, you can ask for help. This is called an accommodation. If you need\nassistance, you can contact your case manager or call the DTA Assistance line to be connected\nto a Client Assistance Coordinator.\nSafety concerns or other issues because of domestic violence: If you are dealing with the\nimpacts of domestic violence, DTA can help. The Domestic Violence (DV) Unit can help address\nsafety concerns and other impacts of domestic violence. Find your local DV specialist. If it is an\nemergency or after hours, call SAFELINK at (877) 785‐2020.\nLimitations:\nFor most families, benefits are only available for 24 out of every 60 months (i.e. 2 out of 5\nyears), but there are exceptions to the rule for some recipients. The adult recipient of TAFDC\ncan be working and still receive these benefits.\nImmigrants: Many immigrants who legally entered the country after 8/22/96 face a five year\nwait before becoming eligible (but not veterans, refugees, asylees and some others).\n"
    },
    {
        "page": 4,
        "content": "Amount assigned per family:\nFamily members\nNo rent allowance\nWith rent allowance\n1\n$513\n$553\n2\n$648\n$688\n3\n$783\n$823\n4\n$912\n$952\n5\n$1,045\n$1,085\n6\n$1,183\n$1,223\n7\n$1,316\n$1,356\n8\n$1,316\n$1,356\n9\n$1,448\n$1,488\n10\n$1,714\n$1,754\nIncrement\n$139\n$139\nAgency information:\nDTA office: 1-800-249-2007\nDTA Recipient Services Unit: 1-800-445-6604\nProgram Name: EITC\nEarned Income Tax Credit, sometimes known as Earned Income Credit (EIC)\nAgency: United States Internal Revenue Service (IRS) and Mass. Department of Revenue\n(DOR)\nDescription: The EITC is a credit for people with low or moderate earned income. The EITC\nmay reduce your tax bill and give you a refund. Find out if you qualify.\nThe Massachusetts EITC is available to certain individuals or families who meet the tax\nrequirements for the federal EITC.\nTo claim the Massachusetts EITC, you must file a tax return and be a Massachusetts resident\nfor at least part of the taxable year.\nWebsite: www.irs.gov/eitc & https://www.mass.gov/info-details/earned-income-tax-credit-eitc\nEligibility:\n●\nYou had a qualifying child during the taxable year, or\n●\nYou did not have a qualifying child during the taxable year and you meet the following\ncriteria\n○\nYou lived in the United States for more than one-half of the taxable year;\n"
    },
    {
        "page": 5,
        "content": "○\nYou or your spouse had attained age 25 but had not attained age 65 before the\nclose of the taxable year*; and\n○\nYou were not a dependent of another taxpayer during the tax year.\nTo be eligible for the EITC, you must also meet the following additional criteria:\n●\nYou, your spouse and any qualifying child have a valid Social Security Number (if your\nqualifying child does not have a social security number, you and your spouse may qualify\nfor the EITC that is available for taxpayers without qualifying children);\n●\nYou have earned income\n●\nYour adjusted gross income is within certain limits; and\n●\nYour filing status is:\n○\nSingle, head of household, or married filing a joint return; or\n○\nMarried filing separate, and you have a qualifying child who lived with you for\nmore than half of the tax year, and either of the following apply (1) you lived apart\nfrom your spouse for the last 6 months of the tax year, or (2) you are legally\nseparated according to your state law under a written separation agreement or a\ndecree of separate maintenance and you didn't live in the same household as\nyour spouse at the end of the tax year; or\n○\nMarried filing separate and you are the victim of domestic abuse, and all of the\nfollowing apply: (1) you are living apart from your spouse at the time you file your\ntax return; (2) you are unable to file a joint return because you are a victim of\ndomestic abuse, and (3) you indicate this on the return. See Form1 Instructions\nto line 43.\nLimitations:\n●\nYou did not file a Massachusetts return for the tax year;\n●\nYou were a nonresident for the entire taxable year;\n●\nYour status is married filing separately and you do not have a qualifying child or you are\nnot a victim of domestic abuse (see above) or;\n●\nYou and/or your spouse had investment income that exceeds the limit for the taxable\nyear.\nAvailability:\nOne “applies” for the EITC through filing the federal and state income tax forms and “receives”\nthe benefit through one’s tax return check.\nImmigrants: Eligible with valid SSN and if worked in the past year. Immigrant children must\nhave lived in the U.S. for more than 6 months out of the year to qualify. Those with Immigrant\nTaxpayer Identification Numbers (ITINs) do not qualify.\nAmount granted:\n"
    },
    {
        "page": 6,
        "content": "IRS Table for the tax year 2023 for Single/Head of Household or Qualifying Widow(ed), or\nMarried Filing Separately (Taxpayers claiming the EITC who file Married Filing Separately must\nqualify for the Massachusetts exception for victims of domestic abuse).\nMaximum Federal\nAdjusted Gross\nIncome\nNumber of\nQualifying\nChildren\nMaximum\nFederal EITC\nMA\nRate\nMaximum MA\nCredit Allowed\n$17,640\n0\n$600\n40%\n$240\n$46,560\n1\n$3,995\n40%\n$1,598\n$52,918\n2\n$6,604\n40%\n$2,642\n$56,838\n3 or more\n$7,430\n40%\n$2,972\nFor Married Filing Jointly: IRS Table for the tax year 2023 for Married Filing Jointly:\nMaximum Federal\nAdjusted Gross\nIncome\nNumber of\nQualifying\nChildren\nMaximum\nFederal EITC\nMA\nRate\nMaximum MA\nCredit Allowed\n$24,210\n0\n$600\n40%\n$240\n$53,120\n1\n$3,995\n40%\n$1,598\n$59,478\n2\n$6,604\n40%\n$2,642\n$63,398\n3 or more\n$7,430\n40%\n$2,972\n"
    },
    {
        "page": 7,
        "content": "Program Name: SNAP\nFood Stamps was renamed the Supplemental Nutrition Assistance Program (SNAP) in 2008\nAgency: Massachusetts Department of Transitional Assistance (DTA)\nDescription: SNAP is a federal nutrition program administered by the Department of\nTransitional Assistance (DTA) for Massachusetts residents. The benefits can be used in food\nstores but not restaurants to purchase food items.\nWebsite: State info: www.mass.gov/snap; Federal Info: www.fns.usda.gov/snap\nEligibility:\nHousehold gross income not to exceed 130% of Federal Poverty Level and household net\nincome not to exceed 100% FPL to be eligible.\nDeductions and some exceptions apply to income determination. Asset limits and work\nrequirements also apply.\nSNAP eligibility is based on who is in the household, income and certain expenses. “Eligibility”\nmeans who can and can’t get the benefit.\nIf you aren’t sure if you are eligible, apply! The agencywill talk to you and make a decision\nbased on the rules. If you are approved, SNAP will go back to the date you applied.\nLimitations:\n●\nSNAP benefits can be used to purchase food items at most grocery stores, convenience\nstores, and pharmacies (look for sign accepting EBT or Electronic Benefits Transfer\ncards).\n●\nHot foods and non-food items like alcohol, cigarettes, pet food, or medications are not\ncovered.\n●\nTeen parents: If teen is living on her own, she can apply for SNAP herself. However, if\nteen is under age 22 and lives with natural or adoptive parents, or is under 18 living with\nother adults, the parent or adult must apply for SNAP on behalf of teen and the\nhousehold.\n●\nImmigrants: Many non-citizens are eligible for SNAP, such as those who have worked in\nthe U.S. for a certain amount of time or have come into the U.S. with a particular\nimmigration status. Even if head of household is undocumented, he/she should apply for\nother eligible household members.\n●\nSee www.gettingfoodstamps.org/helpforimmigrants.html for more information.\nAmount:\nRecipients do not receive cash; rather, a monthly credit appears on an EBT card which they\nswipe at the store.\nHousehold size, income, assets, and living expenses taken into account when determining a\nfamily’s SNAP allotment. Maximum monthly amount: 1 person=$194, family of 4=$649.\nHousehold Size\nMaximum Monthly\nIncome (before taxes)\nMaximum Monthly SNAP\nAmount\n"
    },
    {
        "page": 8,
        "content": "1\n$2,510\n$291\n2\n$3,407\n$535\n3\n$4,303\n$766\n4\n$5,200\n$973\n5\n$6,097\n$1,155\n6\n$6,993\n$1,386\n7\n$7,890\n$1,532\n8\n$8,787\n$1,751\nEach additional\nperson\n+ $897\n+ $219\nHow to Apply: Apply online (new applicants only) or through forms and mail completed\napplication to DTA, PO BOX 4406, Taunton, MA 02780.\nNote: A phone interview and submission of verifications are required after application is\nsubmitted.\nABCD neighborhood sites (www.bostonabcd.org) can help with application, or call Project\nBread’s FoodSource Hotline at 1-800-645-8333 to see if eligible and start application over the\nphone.\nApply in person at local DTA office.\nProgram Name: Lifeline Program\nAgency: Federal Communications Commission (FCC)\nDescription: Lifeline is a federal program that provides free or low-cost phone or internet\nservice to low-income households through a monthly service discount of up to $9.25. Lifeline\nsubscribers have the choice of applying their benefit discount to either (1) home phone service;\n(2) home internet service, where available, or (3) a wireless phone plan with data. The Lifeline\nProgram subsidy does not cover the cost of a wireless device, but some Lifeline Providers may\nchoose to offer an initial wireless device upon completing enrollment. If you have a mobile\n"
    },
    {
        "page": 9,
        "content": "device you would like to use with your Lifeline service, please contact the Lifeline wireless\nservice provider prior to completing enrollment to see if your device is compatible with the\nprovider’s network.\nWebsite: https://getinternet.gov/apply?id=nv_home&ln=RW5nbGlzaA%3D%3D\nEligibility: Eligibility is based on income at or below 135% of the Federal Poverty Guidelines or\nparticipation in certain federal assistance programs such as Medicaid, SNAP, SSI, Federal\nPublic Housing Assistance, or Veterans Pension and Survivors Benefit.\nAvailability: Provides a discount on monthly charges for phone or internet services; only one\nLifeline discount per household is allowed, which can be applied to either a landline or wireless\nservice.\nAmount: Discounts up to $9.25 per month for eligible services. Additional discounts may be\navailable for residents on Tribal lands.\nApplication: Can be completed online, by mail, or through an approved Lifeline service\nprovider.\nLinked Services: Recipients may also be eligible for other benefits depending on their\nparticipation in federal assistance programs.\nAppeals: Consumers can appeal decisions regarding eligibility or benefit amounts through the\nLifeline Support Center.\nRetroactive: No retroactive discounts are provided. Benefits apply from the date of approval\nonwards.\nHow to Apply: Link Health can assist with the application process by completing this form:\nhttps://formfacade.com/public/100814590887757400074/all/form/1FAIpQLSfSL4s87SaYoVZ2Ac\nRX3JZ4Qqu9jPp5X54h3lQIPH_4OcU6Ag\nProgram Name: WIC\nWomen, Infants and Children Nutrition Program\nAgency: Massachusetts Department of Public Health\nDescription: Federal food program administered by the Massachusetts Department of Public\nHealth (not DTA) for children under 5 years old and their legal parent/guardians (i.e. it’s not just\ntheir mothers who can apply). WIC provides an EBT card to purchase healthy food, as well as\noffering nutritional education, breastfeeding classes, and other helpful services for children and\nfamilies.\nWebsite: https://www.mass.gov/orgs/women-infants-children-nutrition-program\n"
    },
    {
        "page": 10,
        "content": "Eligibility:\nTo be eligible, an individual must: be a child under 5, new mom, or breastfeeding woman; have\na family/household income at or below 185% of Federal Poverty Level (family of 2 or a pregnant\nwoman=$30,004; family of 4=$45,510); and have a nutritional need/risk determined by a health\nprofessional. Women who may have had a miscarriage or given child up for adoption are still\neligible for WIC during their postpartum period.\nLimitations:\n●\nIndividuals are automatically eligible if they are receiving TAFDC, SNAP, or MassHealth\nbenefits and have children under 5. Foster children under age 5 are also automatically\neligible. WIC is only usable for certain approved nutritious foods, unlike like SNAP\nbenefits. Recipients receive a list of foods and participating retailers at enrollment.\n●\nWIC is a short-term program. Therefore, a participant will \"graduate\" at the end of one or\nmore certification periods. A certification period is the length of time a WIC participant is\neligible to receive benefits. An eligible individual usually receives WIC benefits from 6\nmonths to a year, at which time she/he must reapply.\n●\nImmigrants: There are no immigration limitations for WIC recipients.\nRequirements to apply for WIC benefit:\nFor your appointment, you will need the following information:\n●\nProof of current household income\nBring proof of income for everyone in your household. Examples include:\n○\nA pay stub from a recent check (within 30 days)\n○\nA letter from an employer\n○\nIf you currently receive MassHealth/Medicaid, Supplemental Nutrition Assistance\nProgram (SNAP) or TAFDC, you can bring proof of your participation in one of\nthese programs as proof of household income.\n●\nProof that you live in Massachusetts\nExamples include:\n○\nUtility bill\n○\nPostmarked piece of mail addressed to you at your address\n○\nLease or a rent receipt from your landlord\n○\nDrivers license or other ID card\n●\nProof of identity\nBring identity for everyone who will be on the WIC program. Examples include:\n○\nDriver's license\n○\nBirth certificate\n○\nMassHealth card\n○\nWork or school ID\nTalk to the WIC clinic if you are having problems bringing any of the above information. All\ninformation shared with WIC is confidential.\nAmount:\n"
    },
    {
        "page": 11,
        "content": "Shopping with WIC saves families an estimated $100-$200 dollars per month on groceries\ndepending on the size of the households. For example, the average monthly benefit is $56 for\nchildren, $79 for breastfeeding women, and $66 for pregnant women.\nWIC participants receive an EBT card to purchase specific foods each month that are designed\nto supplement their diets with specific nutrients. There is no maximum dollar amount per month,\nbut rather a max “barcode” amount. This means that a family can scan and buy a max amount\nof certain foods (every item has a barcode) per month.\nHow to Apply:\nCall 1-800-WIC-1007\nOr apply in person at local WIC office. Click on local area of the state map to find closest office:\nwww.mass.gov/eohhs/consumer/basic-needs/food/wic/participants/offices/\nWIC also has a “WIC Shopper” App for Smartphones which allows participants to view available\nbenefits and scan food product barcodes while shopping to determine if the item is WIC\napproved.\nLinked Services to WIC? Children receiving TAFDC, SNAP, and/or MassHealth benefits are\nautomatically eligible for WIC.\nRight to appeal for WIC application? Yes, within 60 days of denial.\nIs WIC retroactive? No.\nProgram Name: Fuel Assistance or LIHEAP\nMore formally known as LIHEAP: Low-Income Home Energy Assistance Program; includes\naccess to Weatherization and other services.\nAgency: Primarily Community Action Agencies across Massachusetts. Boston, Brookline &\nNewton, Malden & more are served by Action for Boston Community Development, Inc.\n(ABCD).\nDescription: Combined state and federally funded program which provides low income\nhouseholds with winter energy service payment assistance through direct payments to utility or\nvendor. This includes purchased oil, gas, electricity or even firewood – any energy used to\nprovide winter heat.\nWebsite: www.bostonabcd.org/energy &\nhttps://www.mass.gov/info-details/learn-about-home-energy-assistance-heap\nEligibility:\nHomeowners & renters are eligible (even when heat is included in the rent). Massachusetts has\nincreased income eligibility level to 60% of state median income.\nHousehold income cannot exceed 60% of Massachusetts’ estimated State Median Income.\nWhile income is not the only factor in eligibility, please find the maximum FY 2025 income\nguidelines in the table below:\nHousehold Size\nMaximum Income Level\n"
    },
    {
        "page": 12,
        "content": "1\n$49,196\n2\n$64,333\n3\n$79,470\n4\n$94,608\n5\n$109,745\n6\n$124,882\n7\n$127,720\n8\n$130,559\n9\n$133,397\n10\n$136,235\n*Not all income counts toward eligibility, so please confirm your actual eligibility with your local\nagency.\nLimitations:\nOperates November 1 – April 30 (but often extended 1 month more depending on the year).\nImmigrants: Any income-qualifying household, as long as one member has a social security\nnumber, is eligible. Unfortunately, the amount received will only be based on the number who\nhave SS numbers.\nAmount:\nDepending on income level, for those in non-subsidized housing: up to $1,600 in deliverable\nfuel. For those in subsidized housing: up to $1,120 for deliverable fuel. (Note: amount varies\ndramatically by year and state appropriation).\nHow to Apply:\nThe online application opens on October 1 for the upcoming heating season (November 1, 2024\n– April 30, 2025). You can submit an application online, in person at the agency in your area, or\nby mail.\nIn Boston, Malden, Medford & Everett: call ABCD: 1-617-357-6012\nEven if over income, apply! Client can then be directed to other utility payment sources.\nLinked Services? A Fuel Assistance application opens the door to many energy-related\nservices, including: utility rate reductions, home energy audits with potential no-cost heating\nsystem replacement and weatherization services. Utility bill arrearages can be re-negotiated\n"
    },
    {
        "page": 13,
        "content": "through fuel assistance. Home electrical audits may result in no-cost, refrigerator & other\nelectrical appliance replacements.\nRight to appeal? Yes, submit a statement requesting appeal within 20 days of receiving the\nwritten decision to ABCD fuel program. Technical deadline to submit additional documentation if\nrequired is 20 days from letter, but often accepted as late as July.\nRetroactive? Payments are made directly to the oil or utility company and can be used to\npayback arrearages and turn services back on.\nProgram Name: School Breakfast/Lunch\nNational School Lunch Program\nAgency: Massachusetts Department of Elementary & Secondary Education (DESE)\nDescription: The National School Lunch Program (NSLP) is a federally assisted meal program\noperating in nearly 95,000 public and nonprofit private schools and residential childcare\ninstitutions. It provides nutritionally balanced, low-cost or free lunches to more than 26 million\nchildren each school day.\nWebsite: https://www.doe.mass.edu/cnp/nprograms/nslp.html\nEligibility:\n●\nEligible for free meal: Income below 130% Federal Poverty Level\n●\nEligible for reduced price meal: Income between 130% and 185% Federal Poverty Level\n●\nCategorically eligible: Any child/family that receives SNAP, TAFDC, or Head Start, or any\nchild that is a homeless/runaway, or foster child.\nLimitations:\n●\nHouseholds that have experienced a change in income due to layoffs or decreased work\nhours can reapply for meal benefits even if they were denied benefits prior to that\nincome change.\n●\nHouseholds whose income is slightly too high to qualify for free or reduced price school\nmeals may still be eligible for SNAP. This is because the income threshold for SNAP in\nMassachusetts is higher than the income threshold for free or reduced price meals.\nOnce students qualify for SNAP, they are automatically eligible for free school meals.\n●\nImmigrants: Immigration status is not a barrier to receiving benefit. Social security\nnumber not required, and all information contained in the application is confidential.\nAmount:\nA meal, rather than direct cash or vouchers to purchase food, is provided.\nHow to Apply:\nFor application information, contact the school that the child attends. Applications can be filled\nout at any time during the year. Households who recently experienced a change in income can\nreapply. If a school has 40% or more of its students automatically eligible for School Lunch, then\nthe school will gain “community eligibility” and free lunch will be offered to all students at the\nschool with no applications needed.\nCall Project Bread for more information:\nPhone: 1-617-723-5000\nE-Mail: cnop@projectbread.org\n"
    },
    {
        "page": 14,
        "content": "Linked Services? Receiving School Lunch services does not automatically qualify one for other\nservices, although similar income guideline levels suggest eligibility to them.\nRight to appeal? There is no standard procedure, contact DESE if feel wrongly denied.\nRetroactive? No, but children who received free/reduced meals in prior year have a 30 grace\nperiod to re-apply.\nProgram Name: Massachusetts Senior Nutrition Program\nAlso referred to as “Meals on Wheels”\nAgency: Administration on Aging of the United States Department of Health and Human\nServices, operated by Massachusetts Executive Office of Elder Affairs\nDescription: The mission of Massachusetts Meals on Wheels is to provide nutritionally\nbalanced meals to elders, their spouses, and their dependents with disabilities in the\nCommonwealth. Along with the meals we provide safety checks and opportunities for social\nengagement, as well as nutrition education and counseling.\nWebsite:\nhttps://www.massmealsonwheels.org/#:~:text=The%20mission%20of%20Massachusetts%20M\neals,as%20nutrition%20education%20and%20counseling.\nEligibility:\nPeople age 60 or older and their spouses are eligible to receive nutrition services. There is no\nincome eligibility requirement, but a voluntary donation of $2 per meal is suggested. For those\nreceiving meals in their homes, some eligibility standards must be met such as inability to attend\ncongregate sites due to physical, emotional, or cognitive impairments. Handicapped or disabled\npeople under age 60 are also eligible for free meals if they live in elderly housing facilities where\ncongregate meals are served.\nLimitations:\n●\nMeals are available during the week and some programs offer them on the weekends. In\naddition to meals, congregate meal sites may provide supportive services such as\ninformation and referral for medical services, transportation, health screening, and\nrecreational activities.\n●\nImmigrants: No immigration status questions are asked upon enrollment.\nAmount:\nAt least 1 meal per day is served (or delivered), and each meal contains 1/3 of the current daily\nrecommended dietary intake of nutrients and considers the special dietary needs of the elderly.\nHow to Apply:\n●\nSenior nutrition agencies are located throughout Massachusetts.\n●\nTo find the nearest agency, call the Executive Office of Elder Affairs at 1-800-882-2003\nor use this map to locate an agency nearby: contactus.800ageinfo.com/FindAgency.aspx\n●\nIf the client needs home-delivered meals, a program representative will arrange an\nappointment to meet with the client at home for a home-delivered meal assessment.\nLinked Services? SNAP services have been streamlined for low income elders.\nRight to appeal? No process of appeal.\n"
    },
    {
        "page": 15,
        "content": "Retroactive? No.\nHealth Care & Health Insurance:\nMassHealth, ConnectorCare, Health Safety Net,\nMedicare (Parts A, B & D), Prescription Advantage\nProgram Name: MassHealth (Medicaid)\nMassachusetts version of Medicaid and Children’s Health Insurance Program (CHIP)\nAgency: MassHealth/Massachusetts Office of Medicaid\nDescription: MassHealth provides health benefits and help paying for them to qualifying\nchildren, families, seniors, and people with disabilities living in Massachusetts. We may offer\nbenefits directly or help pay for all or part of your health insurance premiums. If you are a\nmember, you may have access to doctor visits, dental, prescription drugs, behavioral health\nservices, and other important health care services.\nWebsite: www.mass.gov/masshealth\nEligibility:\n●\nTo be eligible, individuals must fall into one of the following groups: parents of minor\nchildren with income up to 133% Federal Poverty Level (FPL); all children under 19\n(including undocumented) in families up to 150% FPL; young adults 19-20 up to 150%\nFPL; pregnant women up to 200% FPL; disabled adults up to 133% FPL; those living\nwith HIV up to 133% FPL; and those with breast or cervical cancer up to 250% FPL.\nLimitations:\n●\nCoverage includes: doctor’s visits, hospital stays, long term care, behavioral health\nservices, substance abuse services, prescription drugs, and some dental care.\n●\nImmigrants: Open to all legally documented immigrants who otherwise qualify. Complex\nrules, but anyone except completely undocumented immigrant adults likely to qualify for\nsome form of coverage. There are also exceptions for undocumented immigrants who\nare pregnant, and for undocumented children under 19 years of age.\nAmount:\nCoverage may require a premium payment each month for certain MassHealth members who\nhave incomes above 150% FPL. Copayments for some services may also be required, such as\nfor prescriptions and inpatient hospital stays (ex: $1 for generic drugs and $3 for entire hospital\nstay). Certain groups are excluded from copayments such as pregnant women and children\nunder 21.\nHow to Apply:\n●\nCall Customer Service for information on application and case: 1-800-841-2900\n●\nApply online through the state’s Health Connector website: www.mahealthconnector.org\n●\nApply by phone at 1-877-623-6765, or in person at a MassHealth Enrollment Center.\nLinked Services? SSI, TAFDC, and EAEDC recipients are eligible for MassHealth Standard.\nMassHealth transitional coverage continues for 4 months when recipient leaves TAFDC (12\n"
    },
    {
        "page": 16,
        "content": "months if left for employment). Recipient will not be terminated after that until rescreened by\nMassHealth. Eligibility for MassHealth also signals likely eligibility for SNAP.\nRight to appeal? Yes, legal notice from MassHealth denying application will include appeal\ninformation.\nRetroactive? Retroactive 10 days; longer for elderly.\nProgram Name: ConnectorCare\nAgency: Massachusetts Commonwealth Health Insurance Connector Authority Description:\nConnectorCare plans are affordable health insurance plans offered through the Massachusetts\nHealth Connector. They have low monthly premiums and low out-of-pocket costs, with no\ndeductibles.\nWebsite: www.mahealthconnector.org\nEligibility:\n●\nIndividuals not otherwise eligible for MassHealth, from 133.1% FPL to 300% FPL are\neligible for ConnectorCare. A variety of price and coverage plans are available for\nindividuals and families, which are offered via private health insurance companies. If\nincome is higher than 300% FPL, one will not qualify for a ConnectorCare plan.\n●\nHowever, one may still be able to get federal tax credits that help to lower the cost of\nmonthly premiums.\nLimitations:\n●\nCoverage includes: doctor’s visits, hospital stays, emergency services, prescription\ndrugs, and mental health services (unlike MassHealth, it does not cover dental,\neyeglasses, or long term services and supports). Each insurer’s plan may have different\ndoctors or hospitals in their provider networks. Use the Find a Provider tool at\nProviderDirectory.MAhealthconnector.org to see which providers are in a plan’s network.\n●\nImmigrants: Open to all legally documented immigrants who otherwise qualify.\nAmount:\nPremiums and co-pays vary based on income, age, location, and tier of coverage plan. No\ndeductibles.\nThe cost of ConnectorCare plans differs depending on the health insurer and the Plan Type.\nThe Plan Type you qualify for is based on your income. The chart on the right shows the FPL\nranges for different ConnectorCare Plan Types.\nPlan Type\nFPL Range\n2024 Lowest-cost\nMonthly Premium,\nper person\nPlan Type 1\n0–100%\n$0\nPlan Type 2A\n100.1–150%\n$0\n"
    },
    {
        "page": 17,
        "content": "Plan Type 2B\n150.1–200%\n$49\nPlan Type 3A\n200.1–250%\n$96\nPlan Type 3B\n250.1–300%\n$142\nPlan Type 3C*\n300.1–400%\n$219\nPlan Type 3D*\n400.1–500%\n$255\n*Plan Types 3C and 3D are new plan types for plan year 2024.\nHow to Apply:\nApply online through the state’s Health Connector website: www.mahealthconnector.org\nApply by phone at 1-877-623-6765, or in person at a MassHealth Enrollment Center.\nLinked Services? None\nRight to appeal? Yes, legal notice from MassHealth/Connector denying application will include\nappeal information Must appeal a decision within 30 days of receipt of denial notice or 120 days\nif no written response by MassHealth/Connector to application.\nRetroactive? Plans are effective first of next month. If eligible, can get Health Safety Net care\nwhile waiting for ConnectorCare to kick in.\nProgram Name: Health Safety Net (HSN)\nFormerly known as Uncompensated Care Pool or “Free Care”\nAgency: Health Care Finance & Policy branch of EOHHS; Managed by the Massachusetts\nOffice of Medicaid\nDescription: The Health Safety Net pays for certain medically necessary services provided to\nqualified low-income patients at Massachusetts community health centers (CHCs) and acute\ncare hospitals. The HSN also pays CHCs and acute care hospitals for medical hardship\nexpenses (when qualifying medical expenses exceed a specified percentage of a family's\nincome), and for some types of bad debt.\nWebsite: https://www.mass.gov/info-details/health-safety-net-for-patients\nEligibility:\n●\nOne must first apply for MassHealth and ConnectorCare, and will only receive HSN if\nincome eligible but do not meet other requirements for those programs. Coverage is fully\nsubsidized for otherwise uninsured individuals/families with income below 200% FPL\n(single person=$24,120; family of 4=$49.200); partially subsidized for those up to 400%\nFPL (single person=$48,240; family of 4=$98,400), or higher if one’s medical bills\ndramatically exceed income.\nThe Health Safety Net (HSN) is available to uninsured and underinsured Massachusetts\nresidents whose family income is under a certain percentage of the Federal Poverty Level\n(FPL):\n"
    },
    {
        "page": 18,
        "content": "●\nMassachusetts residents with income between 0-150% of the FPL may be eligible for the\nHealth Safety Net.\n●\nMassachusetts residents with income above 150% and equal to, or less than 300% FPL\nmay be eligible for the Health Safety Net with a deductible.\nThe HSN can act as a secondary payer for eligible individuals enrolled in:\n●\nprivate insurance,\n●\nstudent health insurance,\n●\nMedicare,\n●\ncertain MassHealth programs,\n●\nQualified Health Plan, or\n●\nConnectorCare (for the first 90 days)\nLimitations:\n●\nHSN coverage lasts for up to 1 year. Homeless residents and immigrants qualify for\nservices. HSN has a limited number of community health centers, hospitals, dental\nservices and pharmacies in its network. See\nmass.gov/eohhs/consumer/insurance/more-programs/health-safety-net/for-patients.html\nfor a list of approved providers.\n●\nImmigrants: Must be a resident of Massachusetts; immigration status does not matter.\nHSN is the health care program of last resort for undocumented immigrants.\nAmount:\n●\nHSN pays part or all of the cost for medically necessary services at specific community\nhealth centers and hospitals. The biggest providers of this care in the Boston area are\nBoston Medical Center and Cambridge Health Alliance.\nHow to Apply: Get a paper application by calling MassHealth at 1-800-841-2900 or meet with\ncounselors at local hospital or community health center for help with the application. For more\ninformation, call the Health Safety Net Customer Service Center at 1-877-910-2100 or email\nhsnhelpdesk@state.ma.us.\nLinked Services? Common application for MassHealth, ConnectorCare and Health Safety Net.\nRight to appeal? Yes, legal notice from MassHealth denying HSN application will include\nappeal information. Appeal must be filed within 30 days of receipt of determination notice.\nRetroactive? Yes, if person can prove they qualified for HSN at least 10 days prior to\napplication.\nProgram Name: Medicare\nAgency: United States Centers for Medicare and Medicaid Services\nDescription: Medicare is health insurance for people 65 or older. You may be eligible to get\nMedicare earlier if you have a disability, End-Stage Renal Disease (ESRD), or ALS (also called\nLou Gehrig’s disease).\nSome people get Medicare automatically, others have to actively sign up -- it depends if you\nstart getting retirement or disability benefits from Social Security before you turn 65.\n"
    },
    {
        "page": 19,
        "content": "It is divided into parts: Medicare Part A provides hospitalization coverage; Part B provides\noutpatient coverage (doctors visits, etc.) and Part D provides prescription drug coverage. Part C\nlets private companies do all of the above for an extra fee.\nWebsite: www.medicare.gov\nEligibility:\n●\nEligible if 65 or over, have end-stage renal disease or ALS (regardless of age), or have\nbeen disabled & receiving SSDI for more than 24 months.\nLimitations:\n●\nPart A (hospital coverage) is automatic enrollment at 65, but people must choose to\nenroll in Part B (doctor’s visit coverage) and pay a premium which rises most years with\ninflation. Part B average cost: $109/month for SS recipients paying the premium through\nSS benefits; $134/month for individuals earning $85,000 or less; or couples earning\n$170,000 or less. For those earning more, payment amounts increase up to a maximum\nof $428.50/month. The longer a person over 65 waits to sign up for Medicare, the\ngreater the premiums they will have to pay for Parts B and D.\n●\nImmigrants: “Lawfully present” immigrants with 40 quarters of work history qualify. Those\nwho have been in the country 5+ years but have not worked long enough can purchase\ncoverage.\nAmount:\n●\nPart B has a yearly deductible of $183. After deductible is met, recipient pays 20% of\nMedicare-approved amount for services. Part D has an initial deductible of $400. After\nthis, Medicare will pay cost of prescriptions until total reaches $3700. Between $3700\nand $4950, there is a coverage gap or “donut hole,” where Medicare no longer pays full\ncost. While in the gap, recipient pays ~40% of price for brand name drugs and ~50% for\ngenerics, until total reaches $4950 when full coverage resumes.\nHow to Apply:\nPeople who have chosen to receive Social Security at 65 or have been on SSDI for 24 months\nare automatically enrolled in Medicare at that point and will be mailed a members card for Part\nA coverage. Those with end-stage renal disease or ALS, or not receiving Social Security yet,\nmust request a card.\nFor more information, call 1-800-633-4227.\nLinked Services? None directly.\nRight to appeal? Extensive and complex system of appeals, consisting of five levels, if denied\npayment/coverage for Medicare-related health services. Unclear if there is a time limit for\nappeal. Medicare’s website does not address issue of appealing denial of initial application for\nMedicare.\nRetroactive? Not in general or useful way. Some disabled may see Medicare retroactively pay\nfor some services previously paid by MassHealth.\nProgram Name: Prescription Advantage (PA)\nAgency: Massachusetts Executive Office of Elder Affairs\n"
    },
    {
        "page": 20,
        "content": "Description: Federal and state funded program for seniors to supplement Medicare Part D’s\nprescription drug coverage.\nWebsite: www.mass.gov/elders/healthcare/prescription-advantage/\nEligibility:\nMust be 65 or older (income limit 500% FPL) or meet disability criteria (income limit 188% FPL).\nAvailability/Limitations:\nMust be receiving Medicare Part D or a creditable coverage plan (creditable coverage is\ncoverage as good or better than drug coverage offered by Medicare and is usually provided by\nemployer or union). There is no additional premium for Prescription Advantage, but in some\ncases a yearly enrollment fee may apply. The supplement program covers prescription\nco-payments after recipient reaches Medicare’s “donut hole” coverage gap (currently between\n$3700 and $4950). If income eligible, applicant must apply for “Extra Help” for Medicare Part D\nbefore applying for Prescription Advantage.\nImmigrants: Immigrants qualify regardless of citizenship.\nAmount: Prescription Advantage will provide assistance only for drugs covered by a member's\nMedicare prescription drug plan (Part D), Medicare Advantage plan or creditable coverage plan.\nCo-pays depend on income level.\nHow to Apply:\nCall 1-800-243-4636 or go to www.prescriptionadvantagema.org/Application/ApplyOnline to\napply.\nMay apply before enrolling in Medicare Part D, but must be enrolled before one can receive\nbenefits.\nLinked Services? Massachusetts College of Pharmacy and Health Services (MCPHS)\nPharmacy Outreach Program is a program for anyone needing information on prescriptions\nand/or help paying for them. For more information go to\nwww.mcphs.edu/patient-clinics/pharmacy-outreach-program or call 1-866-633-1617.\nRight to appeal? Applicant can appeal denial of membership in PA through returning the denial\nreconsideration form within 15 days of receiving it. Once a member, PA can then help\nindividuals appeal if Medicare Part D denies coverage of prescribed drug.\nRetroactive? No, coverage starts 1st of next month.\nFor information on health coverage and help with health insurance enrollment: in Boston, call\nthe Mayor’s Health Line 1-617-534-5050, mayorshealthline@bphc.org or statewide call Health\nCare for All’s Help Line: 1-800-272-4232 www.hcfama.org/helpline (contains e-mail link).\nFor specific help on health care coverage for seniors, contact local SHINE (Serving the Health\nInformation Needs of the Elderly) office. For more information see: www.ethocare.org/shine/ or\ncall Ethos’ Boston SHINE program: 1-617-522-9270\nAn excellent website to determine what national benefits seniors are eligible for is Benefits\nCheckup: www.benefitscheckup.org\nEducation & Child Care:\nChild Care Vouchers & Head Start\n"
    },
    {
        "page": 21,
        "content": "Program Name: Child Care Financial Assistance (CCFA)\nAgency: Massachusetts Department of Early Education and Care (EEC)\nDescription: A complex variety of subsidized child care services, such as child care centers,\nfamily child care (at someone’s home) and informal child care (ex: with a relative) are managed\nby area Child Care Resource and Referral Agencies, including Child Care Choices of Boston.\nWebsite: https://www.mass.gov/child-care-financial-assistance\nEligibility:\nFamilies must be below 50% of State Medium Income (SMI) (family of 2=$37,053; family of\n4=$54,489) when they apply for child care and not go over 85% when they are receiving\nchildcare (family of 2=$62,989; family of 4=$92,631). All parents/guardians in the family must\nalso be either: working, seeking employment or enrolled in a training program; retired if over 65;\nor parent and/or child have documented disability.\nLimitations:\n●\nTAFDC recipients automatically receive a childcare voucher for work, education &\ntraining, job search and community service activities. Others who receive child care\nwithout a wait include: former TAFDC recipients who are now working (if apply w/in 12\nmonths) or finished education & training program (if apply w/in 6 months); homeless in\nDTA shelter (if apply within 3 months or as long as applicant starts working or enters\nEducation & Training program); teen parents. All others must get on state income eligible\nwaiting list for child care (a long wait).\n●\nImmigrants: EEC does not review immigration status or report to ICE, but does require\nidentifying documentation and proof of work eligibility, etc. for various child care\nvouchers. However, no child shall be denied child care assistance based solely on\napplicant’s failure to demonstrate citizenship or immigration status without final review by\nEEC.\nAmount:\nChild care coverage varies by income, household size and age of child, but there is no\nmaximum cap. Co-pays are based on a sliding scale: families in Tier Level 1 income bracket\n(=family of 2 earning up to $971/month) pay $0. Fees rise in multiple increments up to\n$205/week for a family earning 85% SMI or 100% SMI income if child has disability.\nHow to Apply:\nCall 1- 617-542-5437 to apply or email: help@childcarechoicesofboston.org\nThe “income-eligible” wait list is very long, so get name on it early if not qualified for an\nimmediate child care voucher.\nLinked Services? Transportation for children to and from child care can be added to the\nvoucher in certain circumstances.\nRight to appeal? Yes, through EEC or DTA, depending on type of voucher. The Resource &\nReferral Agency will provide an appeal form asking for supportive documentation. Vouchers\nrenew 2 weeks ahead of time in order that any appeals can be processed in a timely fashion. If\nappeal takes longer than 2 weeks, then applicant will get an automatic voucher extension. In\nsome cases exceptions can be made—write a formal submittal to EEC to request one.\nRetroactive? No, unless couldn’t get a voucher renewed in timely manner.\n"
    },
    {
        "page": 22,
        "content": "Program Name: Head Start\nAlso includes information on Early Head Start\nAgency: Office of Head Start, Administration for Children & Families, US Dept. of Health &\nHuman Services\nDescription: A federally funded and locally operated program which promotes school readiness\nby providing comprehensive education and child care for low-income children ages 5 and under,\nemphasizing family involvement and connection to appropriate services.\nWebsite: www.bostonheadstart.org\nEligibility:\nOpen to families with incomes at or below 100% FPL (family of 2=$16,240; family of\n4=$24,600), although individual sites can serve some higher income families if space is\navailable. Children from families receiving TAFDC or SSI are automatically eligible, regardless\nof income.\nAvailability/Limitations:\nTo enroll, child must be at least three years old as of September 1st and no older than 5 years.\nEarly Head Start provides services for pregnant women, babies and toddlers up to three years\nold. Even if it is late in the “school year,” Head Start often has slots open, although Early Head\nStart is often full.\nThis is an excellent program because it works with the entire family in a positive, holistic way,\nand not just the individual child. Includes physical & mental health services (often dental\ncheckups also) as well as nutrition education & meals support services for child.\nImmigrants: Immigration status not a barrier.\nAmount:\nNo direct cash equivalent.\nHow to Apply:\nCall ABCD: 1-617-348-6272 to find out if eligible and apply.\nLinked Services? Head Start will help families apply for other benefits for which they qualify.\nRight to appeal? No formal process of appeal.\nRetroactive? No, child starts as soon as “school year” begins or slot becomes open.\nHousing and Homelessness:\nEmergency Assistance, HomeBASE, RAFT, MRVP\nFor homeless individuals in the Boston area:\nHomeless men: contact Pine Street Inn: www.pinestreetinn.org and click on “Find help” or call\n1-617-892-9100. It is located at 444 Harrison Avenue in Boston.\nHomeless women: contact Rosie’s Place: www.RosiesPlace.org and click on “Programs” or call\n1-617-442-9322. It is located 889 Harrison Avenue in Boston.\n"
    },
    {
        "page": 23,
        "content": "Program Name: Emergency Assistance (EA)\nAgency: Massachusetts Department of Housing and Community Development (DHCD), Division\nof Housing Stabilization (DHS)\nDescription: A state funded program which provides emergency shelter and helps find\npermanent housing for homeless families with dependent children (under 21 years old).\nSometimes it also helps cover housing costs.\nWebsite: www.masslegalhelp.org/income-benefits and click on “Emergency Shelter”\nEligibility:\nMust be homeless family with children under 21 and/or a pregnant woman (husband of pregnant\nwoman can get shelter too). To be eligible, family’s income must be <115% of FPL (family of 2=\n$1,556/month; 4=$2,358/month); the asset limit is $2,500 (but ok to have car under $15,000).\nWages and cash benefits (TAFDC, EAEDC, SSI) count as income. Food Stamps do not count\nas income.\nWhat counts as homeless and eligible for EA? Victims of domestic violence or natural disaster\n(fire, flood, etc.), no-fault eviction, or do not have a safe place to stay. According to DHCD, being\n“doubled-up” (living with friends/relatives) or facing eviction does not make one automatically\neligible for EA. DHCD will assess whether the situation warrants EA services immediately or not.\nLimitations:\nTo receive EA, family must agree to and sign a Re-Housing Plan, which includes searching for\npermanent housing, working or attending training, saving 30% of household net income and\nkeeping children in school. If family does not stick to plan, they could lose EA benefits.\nNote: If recipient is a parent under 21, he/she will be first placed in an EA Congregate Shelter or\nTeen Living Program.\nImmigrants: EA is available to immigrants with legal status, including refugees, lawful permanent\nresidents and persons residing in the U.S. under color of law. Note: If any member of the\nhousehold has one of these statuses or is a citizen, the entire household meets this rule. Must\nalso show proof of Massachusetts residency.\nAmount:\nThis is not a cash benefit but rather provides a roof over a family’s head.\nHow to Apply:\nTo apply via phone, call DHCD Recipient Services: 1-866-584-0653\nOr visit DTA Boston office located at 2201 Washington St., Roxbury, MA; phone:\n1-617-989-6100\nCan apply in person at some DTA offices, including: Boston (Dudley Square), Brockton,\nChelsea, Fall River, Framingham, Hyannis, Lawrence, Lowell, New Bedford, Salem, Springfield,\nand Worcester.\nLinked Services? May also be eligible for HomeBASE.\nRight to Appeal: Yes, if within 21 calendar days of denial of EA shelter. Can remain in shelter if\nappeal within 10 days of notice.\nRetroactive? No.\n"
    },
    {
        "page": 24,
        "content": "Program Name: HomeBASE\nAlso known as Massachusetts Short-Term Housing Transition Program Agency: Department of\nHousing and Community Development (DHCD), Division of Housing Stabilization (DHS)\nDescription: State funded program which helps homeless families pay rent for up to 1 year.\nHomeBASE is available to help families avoid going into shelters or assist them with leaving a\nshelter.\nWebsite:\nhttps://www.masslegalhelp.org/housing-apartments-shelter/emergency-shelter/emergency-assis\ntance-basic-shelter-rights-families & https://www.mass.gov/info-details/homebase\nEligibility:\nMust be very low-income (<115% FPL) homeless family with children under 21 and/or a\npregnant woman to qualify. Homeless means 1) either homeless or about to be homeless in a\nfew days; 2) have no safe place to stay and 3) meet Emergency Assistance eligibility (see prior\npage). If family does not have a safe place to stay, DHCD must put them in an EA shelter or\nshort-term HomeBASE apartment, even before family has found a long-term place to live with\nHomeBASE.\nAvailability/Limitations:\nTo receive HomeBASE, a family must first be found eligible for Emergency Assistance (EA), so\nit is important to complete an EA application as well. Family must agree to and sign a\nStabilization Plan, which includes paying rent on time, working or attending training, saving\nmoney, and keeping children in school. If family does not stick to plan, they could lose\nHomeBASE benefits for 1 year.\nImmigrants: HomeBASE is available to immigrants with legal status, including refugees, lawful\npermanent residents, and persons residing in the U.S. under color of law. If any member of the\nhousehold has one of these statuses or is a citizen, the entire household meets this rule. Must\nalso show proof of Massachusetts residency.\nAmount: HomeBASE can provide funds for first month’s rent, last month’s rent and security\ndeposit in a new home (up to $8,000), furniture (not to exceed $1,000), a monthly stipend to\nhelp pay rent for up to one year, as well as utilities, travel costs and/or many other expenses\nthat would otherwise prevent a family from accessing a new home.\nHow to Apply:\nTo apply via phone, call DHCD Recipient Services: 1-866-584-0653\nOr visit DTA Boston office located at 2201 Washington St., Roxbury, MA; phone:\n1-617-989-6100\nCan apply in person at some DTA offices, including: Boston (Dudley Square), Brockton,\nChelsea, Fall River, Framingham, Hyannis, Lawrence, Lowell, New Bedford, Salem, Springfield\nand Worcester.\nAlso see, Boston Housing Consumer Education Center: Metropolitan Boston Housing\nPartnership, 125 Lincoln Street, 5th Floor, Boston, MA 02111; phone: 617-859-0400 website:\nwww.mbhp.org\nLinked Services? Family may qualify for Emergency Assistance while waiting for HomeBASE\nsubsidy.\n"
    },
    {
        "page": 25,
        "content": "Right to Appeal: Yes, if appeal request is within 7 days of receiving notice. Hearing must take\nplace within 15 days of request. This applies to both initial denial of benefit and to termination of\nbenefit after having moved into a home. Eligible for aid pending appeal.\nRetroactive? No.\nProgram Name: Residential Assistance for Families in Transition\n(RAFT)\nAgency: Department of Housing and Community Development (DHCD), Division of Housing\nStabilization (DHS)\nDescription: RAFT is a state-funded homelessness prevention program that helps eligible\nfamilies keep housing, get new housing or otherwise avoid homelessness.\nWebsite: https://www.mass.gov/how-to/apply-for-tafdc\nEligibility:\nMust be a family with children under 21 and/or a pregnant woman who is homeless or at risk of\nbecoming homeless to be eligible. Household income must be at or below 50% Area Median\nIncome (AMI). For a family of 2, 50% AMI is $39,400; for a family of 4, 50% AMI is $49,450.\nIn determining eligibility, DHCD will consider the reasons a family is homeless or at risk of\nbecoming homeless, including loss of income and increased expenses. In addition, a family\nmust show that RAFT assistance will stabilize the current housing situation and help avoid\nhomelessness.\nAvailability/Limitations:\nWhen funds are available, RAFT provides money for security deposits, first and last month’s\nrent, moving expenses, utility and mortgage arrears and other housing-related expenses for\nhomeless families and families at risk of homelessness.\nImmigrants: RAFT is available to immigrants with legal status. Social security numbers are\nneeded for all household members, but if the household does not have social security cards\navailable, the agency may accept another form of written documentation that includes the social\nsecurity number (i.e. pay stubs, bank account statements).\n"
    },
    {
        "page": 26,
        "content": "Amount: Eligible families may receive up to $4,000 from RAFT in a 12-month period to pay for\nexpenses to avoid homelessness or rapidly exit homelessness. Families who are receiving\nfunding from the HomeBASE program can access a maximum of $8,000 from the two programs\ncombined.\nHow to Apply:\nTo find a regional agency, call 1-800-224-5124; Family can only be approved in the region\nwhere they plan to use RAFT assistance.\nBoston Housing Consumer Education Center (HCEC): Metropolitan Boston Housing\nPartnership, 125 Lincoln Street, 5th Floor, Boston, MA 02111\nPhone: 1-617-859-0400; Website: www.mbhp.org\nCompleting a HCEC Intake Assessment is the first step to accessing RAFT. Any family can walk\ninto or call the HCEC Resource Center to complete the form, see above for Boston address.\nNote: If a family is seeking assistance with start-up or relocation costs, they should apply for\nRAFT after they have identified their new unit, but before they move in.\nLinked Services: May receive RAFT and HomeBASE simultaneously. Families who received\nonly HomeBASE are not eligible for RAFT funds until 12 months after they first received\nassistance.\nRight to Appeal: Yes, a family may reapply for RAFT after 30 days if they were determined\nineligible. If there are new circumstances or new information, they should contact their local\nHCEC.\nRetroactive? No.\nUnemployment & Career Centers Program Name: Massachusetts\nRental Voucher Program (MRVP)\nAgency: Department of Housing and Community Development (DHCD), Division of Public\nHousing and Rental Assistance Description: State funded program that provides both tenant-\nand project-based rental subsidies (vouchers) to low-income families and individuals. The\nvoucher makes up the difference between what the landlord charges and what the tenant can\npay.\nWebsite:\nwww.mass.gov/hed/housing/stabilization/residential-assistance-for-families-in-transition\nEligibility: An applicant is eligible if their net household income does not exceed 80% of Area\nMedian Income (AMI). The local housing agency will also screen for CORI. At admission, a\nhousehold’s total assets may not exceed 1.5 times the gross household income or $25,000,\nwhichever is greater (cars and 401K do not count as assets).\nAvailability/Limitations:\nThe vouchers are divided into two categories – mobile and project-based. Mobile vouchers can\nbe used by the participant in any eligible unit throughout the state: the participant is responsible\nfor finding a unit. Project-based vouchers, however, are attached to a specific housing unit. A\nparticipant receives the benefit of an MRVP subsidy only when occupying that particular housing\nunit.\n"
    },
    {
        "page": 27,
        "content": "Note: Unlike EA, a household of one or more adults without children could be considered a\n“family” for MRVP purposes.\nImmigrants: There are no citizenship or immigration status requirements for MRVP.\nAmount:\nThe value of the subsidy depends on income, the number of bedrooms and the geographic\narea. MRVP \"mobile\" voucher holders pay between 30-40% of household income as rent.\nProject based voucher holders pay 35-40% of income as rent (40% if heat is included in rent).\nHow to Apply:\nVisit Boston Housing Authority at 52 Chauncy Street, Boston, Ma 02111; phone:1-618-988-4000\nApply online at:\nwww.mass.gov/hed/housing/ph-manage/public-housing-applications-and-documentation\nTo see if waiting list is open locally, click below; applications may be had where waiting lists are\nopen\nportal.hud.gov/hudportal/HUD?src=/program_offices/public_indian_housing/pha/contacts/ma\nLinked Services? A household may receive HomeBASE funds while participating in MRVP, so\nlong as those funds are not used as a rental stipend.\nRight to Appeal: Yes, applicants who are determined ineligible for MRVP are entitled to request\na private conference with the Administering Agency (AA) to discuss its finding as long as they\nappeal within 14 days of denial of eligibility. Following a private conference, the AA must issue a\nwritten decision. The applicant may then request reconsideration by the AA’s board or other\nequivalent body.\nRetroactive? No.\nUnemployment Insurance & Workman’s Comp\nProgram Name: Unemployment Insurance (UI)\nAlso known as Unemployment Compensation\nAgency: Massachusetts Department of Unemployment Assistance (DUA)\n"
    },
    {
        "page": 28,
        "content": "Description: An employer funded and state managed program which provides temporary cash\nbenefits to unemployed individuals who recently lost their jobs through no fault of their own.\nWebsite: www.mass.gov/dua\nAlso see the websites of Boston’s Career Centers:\nwww.mass.gov/lwd/employment-services/one-stop-career-centers/connectjobs/ &\nwww.bostoncareerlink.org/\nEligibility:\nMust have worked approximately 15 weeks in roughly the past 15 months and earned at least\n$4,300.\nAvailability/Limitations:\nMust be able, available to and looking for work to qualify. Yes, can work while collecting\nunemployment but must report earnings to DUA and unemployment benefits may be scaled\nback proportionately. One can collect full benefits for up to 30 weeks/year, but this is capped at\n26 weeks in Massachusetts for people receiving extended benefits. Individuals in approved job\ntraining programs may receive up to an additional 26 weeks.\nUnemployment benefits are taxable. An individual can have taxes withheld from weekly check\nor send in withholding amount to IRS his/herself. If individual is working a bit while receiving\nunemployment, he/she can stretch out checks beyond the 30 weeks.\nImmigrants: Available to all legal workers.\nAmount:\n~50% of prior gross (total) weekly pay, up to a maximum of $742 + $25/dependent child per\nweek if recipient is the sole wage earner in the family (Note: the $25/child can’t add up to more\nthan the 50% of total pay above).\nHow to Apply:\nTo file a claim, call the Teleclaim Center at 1-617-626-6800 or 1-877-626-6800.\nWalk-in Centers located at One-Stop Career Centers: www.mass.gov/careercenters\nThe One-Stop Career Centers are a state-run system of 30+ centers offering employment and\njob training services. They offer multiple services beyond applying for unemployment, including\njob training seminars, job search help, job listings and community service placement.\nLinked Services? Worker and family may be eligible for help with health insurance coverage\nthrough MassHealth. Apply online through the state’s new Health Connector website,\nwww.mahealthconnector.org, by phone 1-877-623-6765 or in person at a MassHealth\nEnrollment Center.\nRight to appeal? If disqualified, will receive written notice of appeal. Must file appeal request in\nwriting within 10 days of disqualification.\nRetroactive? Yes, Massachusetts will pay benefits retroactively from the date filed as long as\npayments are requested during the weeks that claim is being processed.\n"
    },
    {
        "page": 29,
        "content": "Program Name: Worker’s Comp\nWorker’s Compensation\nAgency: Office of Claims Administration, Department of Industrial Accidents (DIA)\nDescription: Employer Insurance funded & state administered program to monetarily\ncompensate workers who are injured on the job or compensate their families if killed.\nWebsite: www.mass.gov/lwd/workers-compensation/ click on “Injured Workers” on left bar\nClient Eligibility:\nIf worker is injured on the job and loses more than 5 partial or full working days to the injury,\nemployer must file accident report within 7 business days after the 5 days.\nAvailability/Limitations:\nEmployer must carry Worker’s Compensation insurance by law, but some don’t. If employer\ndoes not have insurance, worker can “file a claim” against the Worker's Compensation Trust\nFund at DIA to get equivalent compensation, as well as sue the employer. If disabled for less\nthan 5 days, one will be eligible for payment of medical bills but not lost pay.\nIf employer does not file report promptly, worker can file with the company’s Worker’s\nCompensation insurer; look for workplace poster to get details.\nImmigrants: Yes, covers immigrant workers of all statuses.\nAmount:\nThere are several levels of compensation: Temporary, total incapacity=60% of gross weekly\nwage for up to 156 weeks; Permanent, total incapacity=67% of last year’s average wage as long\nas disabled; Permanent partial incapacity= 60% of the difference between weekly wage before\ninjury and after for up to 260 weeks. If die on job, surviving spouse receives 67% of gross\nweekly wage until remarries and dependent children receive $60/week. Can instead collect a\nlump sum settlement. Also get $4000 in burial expenses.\nWorker’s Comp may also cover payment of medical bills, reasonable cost of travel to and from\nmedical visits, as well as other benefits (if recipient is ultimately found disabled).\nHow to Apply:\nCall the Department of Industrial Accidents at 1-617-727-4900 or 1-800-323-3249. Or go in\nperson to the office at 1 Congress Street, Suite 100 Boston, MA 02114-2017.\nLinked Services? None.\nRight to appeal? Yes, although there are multiple types of hearings/conferences & appeal times.\nRetroactive? Yes, to 5 days after injury. May file for up to 4 years after accident.\nOther Benefits\nVeterans’ Services\nProgram Name: Veterans’ Services\nAgency: Massachusetts Department of Veterans’ Services & local city/town departments\nDescription: State and locally funded cash and medical assistance benefits for veterans and\ntheir dependents (child/spouse/parent).\n"
    },
    {
        "page": 30,
        "content": "Website: www.mass.gov/veterans/\nEligibility:\nA veteran is a person who has actively served in the U.S. Army, Navy, Marine Corps, Coast\nGuard, Air Force or full time National Guard duty. To be eligible, individual must no longer be on\nactive duty and must have received honorable discharge.\nAvailability/Limitations:\nVeteran must have served a minimum of 90 days during war time or 180 days in peacetime. No\nminimum service requirements for a person with a Purple Heart or who suffered a\nservice-related disability. Reservists must have been called to and served in active duty to\nqualify. Amount and benefits vary by municipality, individual need and other factors.\nImmigrants: Eligible to serve in the U.S. Armed Forces and therefore eligible for Veterans’\nBenefits.\nAmount:\nCash benefit depends on person’s current income, financial needs & living situation (extra if\nperson is retired or disabled). The maximum benefit amount changes each year depending on\nannual budget allotments of both the state and individual municipalities. If the vet has income\ngreater than the budgeted amount, the individual can only qualify for help with medical costs. If\nindividual income greatly exceeds the budget, the individual might be asked to pay a percentage\nof the medical costs.\nOther Veterans’ benefits available: Mortgage, rental or unpaid utility arrearages; moving\nexpenses; tuition waivers at state schools; counseling; transportation to medical appointments;\nsome catastrophe/disaster help; burial benefits, etc.\nHow to Apply:\nCall 1-617-635-3037 or meet a Veterans’ Services Officer (VSO) at 43 Hawkins St. Boston, MA\n02114\nFor other towns/cities, contact the Town/City Hall, or go to www.mass.gov/veterans/ and look\nunder “Key Resources” and “Find Local VSO”\nLinked Services? VSO’s may help veterans access other services for which they are\nincome-eligible, such as MassHealth or Fuel Assistance.\nRight to appeal? If benefits are denied, lowered or stopped, send appeal within 45 days to state\nSecretary of Veterans’ Services. Existing benefits will continue while appeal is being considered.\nRetroactive? State and local Veterans’ Benefits are only retroactive back to date of application\nbut Federal benefits are retroactive as far back as 7 years.\nGreater Boston Legal Services (GBLS): www.gbls.org/\nGreater Boston Legal Services provides free civil (non-criminal) legal assistance to low-income\npeople in Boston and thirty-one additional cities and towns. The help ranges from legal advice to\nfull case representation, depending on client need. GBLS serves families whose yearly income\ndoes not exceed 125% of Federal Poverty Income Guidelines ($30,375 for a family of four in\n2017). There are no income limits for elderly and Medicare beneficiaries.\n"
    },
    {
        "page": 31,
        "content": "GBLS Main Office: 197 Friend St., Boston, MA 02114 Voice: 1-617-371-1234 Toll-Free:\n1-800-323-3205 TDD: 1-617-371-1228\nCambridge/Somerville Office: 60 Gore Street, Suite 203, Cambridge, MA 02141 Voice:\n1-617-603-2700 TDD: 1-617-494-1757\nMass Legal Services: www.masslegalservices.org/\nSuperb legal services website with detailed written resources on many public benefits and also\na “find legal aid” geographic locator tool.\nUse this page to find legal resources: www.masslegalservices.org/findlegalaid\nMassachusetts Budget and Policy Center: www.massbudget.org\nContains an infographic explaining benefits and eligibility of various programs.\nmassbudget.org/reports/pdf/food_map.pdf\nThe Ride: www.mbta.com/riding_the_t/accessible_services/?id=7108#Ride For individuals who\nare unable to use fixed-route transit (such as the bus or subway) due to a physical, cognitive or\nmental disability, the MBTA provides a door-to-door transportation service. The Ride operates\n365 days a year generally from 5 AM - 1 AM in 58 cities and towns. New or recertifying\napplicants to The Ride must apply for or renew their eligibility by appearing in-person for an\ninterview with a Mobility Coordinator. Call The Ride Eligibility Center at 1-617-337-2727 for an\nappointment. Office hours are Monday - Friday, 8AM to 5PM, or evenings by request.\nYouth Pass: www.mbta.com/fares_and_passes/reduced_fare_programs/?id=6442454105 The\nMBTA offers a monthly, $30 Youth Pass to help low-income school-age youth and select 19-26\nyear olds who are not in middle or high school access affordable transportation. (Those in\nschool should apply for a CharlieCard through their school – contact the school for more\ninformation.) The youth must also live in a participating city or town (Boston, Cambridge,\nChelsea, Lynn, Malden, Quincy, Revere or Somerville as of December 2017). See MBTA\nwebsite above for application or apply through participating cities. For more, Boston-specific\ninfo, call 1-617-635-1389 or email youthline@boston.gov. November 1st is the key date. If the\nyouth turns 19 after November 1st, they are only eligible if enrolled in a HiSET (formally GED) or\njob training program. All program eligibility ends once a youth is 26 and November 1st has\npassed. Note: All youth passes expire every November 1st. Youths must re-enroll each year.\nProgram Name: EAEDC\nEmergency Aid to the Elderly, Disabled and Children\nAgency: Massachusetts Department of Transitional Assistance (DTA)\nDescription: State program that provides monthly cash payments to very low income individuals\nvia Electronic Benefit Transfer (EBT) cards.\nWebsite: www.mass.gov/dta/assistance & www.masslegalhelp.org/income-benefits/eaedc-rights\nEligibility:\nAn individual is eligible for EAEDC if they meet income/asset limits ($2,500 per family), are a\nU.S. citizen or lawful immigrant, and meet one or more of the following: unable to work due to\nDTA recognized physical or mental incapacity; over 65 & waiting for SSI to begin; caring for a\nchild at home not related to him/her; required to stay at home to care for a person who would\n"
    },
    {
        "page": 32,
        "content": "otherwise be institutionalized; and/or participating in a Massachusetts Rehabilitation\nCommission program.\nAvailability/Limitations:\nOne cannot get EAEDC based on a substance abuse disability alone. However, if the individual\nhas a mental or physical health problem related to the substance abuse, he/she may be able to\nget benefits. EAEDC is available when qualified applicants are awaiting an SSI application\ndecision, but overall EAEDC is a very low-paying benefit.\nImmigrants: Legal immigrants can receive EAEDC. Applicants will need to show DTA proof of\nimmigration status.\nAmount:\n$303/month on average in 2017, but varies with income, family size, and living arrangement.\nHow to Apply:\nCall the Application Information Unit, DTA: 1-800-249-2007\nOr contact local DTA office, find via: eohhs.ehs.state.ma.us/DTAOffices/default.aspx\nDTA Recipient Services Unit: 1-800-445-6604 (very useful: will give recipient details on their\nEAEDC account)\nDTA “Field Offices” in Boston:\nNewmarket Square: 1010 Mass Ave., 02118, Phone: 1-617-989-2200\nDudley Square: 2201 Washington Street, 02119, Phone: 1-617-989-6000\nLinked Services? EAEDC recipients also qualify for MassHealth and SNAP benefits.\nRight to appeal? Similar to TAFDC, person has right to appeal denial of benefits up to 90 days\nof notice. If current benefits are terminated or reduced, an appeal filed within 10 days of written\nnotice keeps benefits at full level until appeal is heard.\nRetroactive? Yes, benefits go back to date of application.\nProgram Name: SSI\nSupplementary Security Income\nAgency: United States Social Security Administration\nDescription: Federally funded program to provide monthly cash payments via direct deposit or\npaper checks to very low-income individuals who are elderly, blind, or disabled. Massachusetts\nsupplements the federal SSI monthly amount to make it higher.\nWebsite: www.ssa.gov/ssi & www.ssa.gov/ssi/text-understanding-ssi.htm\nEligibility:\nAn individual is eligible if he/she is low income with few resources and is also over 65, or blind,\nor disabled (often must meet complex eligibility requirements to establish disability, generally\ninvolving much documentation and/or a medical exam). Disabled or blind children whose\nparents have little income may be eligible as well. Cash and assets above $2000 for individuals\nor $3000 per couple count against applicant, but not car or property that is “essential to\nself-support.”\nAvailability/Limitations:\n"
    },
    {
        "page": 33,
        "content": "Agency may be able to do one emergency advance payment for applicants facing financial\ncrisis, no higher than $999. Applicant should apply for/receive EAEDC while waiting for SSI\ndetermination.\nHomeless individuals can receive full SSI benefits for 6 out of 9 months living in a shelter, see\nwww.ssa.gov/ssi/spotlights/spot-homeless.htm for more information.\nImmigrants: Those who fall into one of the seven “qualified aliens” categories are eligible, see\nwww.ssa.gov/ssi/spotlights/spot-non-citizens.htm for more information.\nAmount:\nMaximum benefits for elderly: $735 from federal + $128 from state; For disabled: $733 from\nfederal + $114 from state; For blind: $733 from federal +$149 from state.\nHow to Apply:\nVisit local Social Security Office, find via secure.ssa.gov/ICON/main.jsp\nBoston Social Security Office: Room 148, 10 Causeway Street, Boston, MA 02222\nApply via phone: 1-800-772-1213 or TDD: 1-800-325-0778\nLinked Services? Application for SSI is also an application for Social Security. Recipients are\nautomatically eligible for MassHealth and SNAP benefits.\nRight to appeal? If denied, must appeal within 60 days of initial decision to have case\nreconsidered. If appeal within 10 days of benefit being cut back or terminated, applicant will\ncontinue receiving full benefit until appeal is heard.\nRetroactive? Yes, benefits go back to date of application, but state will first take out the amount\nof EAEDC benefits it paid during the time period that the applicant was waiting for SSI\nacceptance.\nDeveloped by Action for Boston Community Development, Inc.\nProgram Name: SSDI\nSocial Security Disability Insurance\nAgency: United States Social Security Administration\nDescription: Federally funded program to provide monthly cash payments to people who cannot\nwork because of a medical condition that is expected to last at least 1 year or result in death.\nWebsites: www.socialsecurity.gov/disability & www.socialsecurity.gov/pubs/10029.html\nEligibility:\nAn individual is eligible if he/she worked enough “quarters of years” (generally 40, but depends\non age) to qualify for Social Security in general; and worked at least half time in the recent past\nuntil quarter of year that he/she became disabled (ex: 1.5 years/3 years if under 24; 5 years/10\nif over 31; if age 24-31, must have worked half time during those years).\nAvailability/Limitations:\nSocial Security is granted based on: 1) If individual is working, determining earnings 2) Asking\ndoctor to determine severity of disability 3) Seeing if disability appears on the official SS “List of\nImpairments” 4) Deciding if disability prevents individual from returning to old line of work, or if\nhe/she cannot do other work, given impairment, age, education, work experience and skills.\n"
    },
    {
        "page": 34,
        "content": "Apply as soon as become disabled – it can take 3 to 5+ months to qualify and first application is\noften denied, but denial can be overturned on appeal. Applicant should jointly apply for/receive\nEAEDC while waiting for SSDI determination.\nImmigrants: Legal, permanent resident for 5 years (if arrived after 08/96) and have 40 quarters\nof work history, with some exceptions (veteran, etc.) are eligible.\nAmount:\nBenefit level depends on average lifetime earnings, just as with regular social security. There is\nno specific minimum or maximum level. Benefits are adjusted yearly for inflation.\nHow to Apply:\nVisit local Social Security Office, find via secure.ssa.gov/ICON/main.jsp\nBoston Social Security Office - Room 148, 10 Causeway Street, Boston, MA 02222\nApply via phone: 1-800-772-1213 or TDD: 1-800-325-0778\nOr follow this link to apply online: www.ssa.gov/applyfordisability/\nLinked Services? Medicare coverage kicks in after 2 years on SSDI. If SSDI income is too low,\none may also qualify for SSI.\nRight to appeal? If denied or disagree on amount, must appeal within 60 days of initial decision\nto have case reconsidered.\nRetroactive? Yes, benefits are retroactive back to the 6 month anniversary of the disability\noccurring.\nSSI/SSDI and Work: A person can work and continue to receive SSI/SSDI as well as\nMedicare/Medicaid health insurance. Benefits can continue for up to three years into the\nemployment. For the first 9 “trial work” months, benefits continue in full. Benefits continue to be\npaid out for up to 3 years for each month that their earnings are not “substantial.” Social\nSecurity’s new “Ticket to Work” program helps people work their way back into employment\nwhile safeguarding their right to benefits. For more information, see\nwww.socialsecurity.gov/work/ & www.socialsecurity.gov/pubs/10095.html#part1\nProgram Name: Social Security\nAgency: United States Social Security\nDescription: A federal benefit primarily meant for those 65+ (“retirees”) and their spouses,\nincluding divorced or widowed, but also extended to some disabled adults and surviving children\nof deceased parents.\nWebsite: www.ssa.gov\nEligibility:\nPeople with a work history of “40 quarters” (=10 full years) can apply for Social Security as early\nas age 62, but will receive considerably less money monthly than if they apply at or after age 66.\nChildren under 18 (19 if in high school) of retirees/deceased parents eligible for Social Security\nwill receive a monthly check also.\n"
    },
    {
        "page": 35,
        "content": "Availability/Limitations:\nThis is a universal program, available to any citizen/legal immigrant with the documented work\nhistory. It is not “means tested,” meaning it does not have income limits for eligibility. It continues\nfrom date of eligibility/application until death.\nThe age at which a “retiree” receives full benefits has been slowly increasing in the past few\nyears. Now, a person has to be 66 in order to qualify for the full amount, not 65 as in the past.\nThe age limit will not increase again until 2020, and then it will slowly rise to age 67 (for those\nborn in 1960 or later).\nNote: Not all workers are covered by Social Security. Railroad workers, some state government\nworkers, and federal government workers all have separate pension systems that do not\nnecessarily contain the same rights or benefit levels as Social Security.\nNote: Spouses (including ex-spouses & widow(er)s and ones who did not have enough work\nquarters on their own) can receive up to their spouse’s Social Security amount, even if their own\nSocial Security benefit would be less or non-existent.\nImmigrants: Eligible if legal to work and meet above standards.\nAmount:\nMaximum is $2,542/month at 65, average is $1,360 (2016). The longer an individual puts off\nreceiving benefits, the higher the monthly payment thereafter. Payment to seniors continues\nuntil death, payments to disabled continue until no longer disabled, and payments to children\nend at 19.\nHow to Apply:\nVisit local Social Security Office, find via secure.ssa.gov/ICON/main.jsp\nBoston Social Security Office - Room 148, 10 Causeway Street, Boston, MA 02222\nApply via Phone: 1-800-772-1213 or TDD: 1-800-325-0778\nIf any other income sources exist, it is not wise to start Social Security before 66. Individual\nshould apply three months before the date he/she wants benefits to start.\nLinked Services? Medicare eligibility begins at 65.\nRight to appeal? If denied or disagree on amount, must appeal within 60 days of initial decision\nto have case reconsidered.\nRetroactive? Yes, up to 6 months back to date of eligibility.\n"
    }
]